public class Task1
{
    public static void main(String[] args)
    {
        //Задание №1
        System.out.println ("Ответ на задание №1:");
        int clientOS = 0;
        if ( clientOS == 0 ) {
            System.out.println("Установите версию приложения для iOS по ссылке\n");
        } else {
            System.out.println("Установите версию приложения для Android по ссылке\n");
        }
    }
}